# Import

In [1]:
# Import cell 
import pandas as pd
import numpy as np
import re
from sklearn.model_selection import train_test_split
from sklearn.svm import SVC
from sklearn.ensemble import RandomForestRegressor
from sklearn.ensemble import GradientBoostingRegressor
from sklearn.neural_network import MLPRegressor
from sklearn.metrics import mean_squared_error, r2_score

In [2]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /opt/miniconda3/envs/quera_ai/lib/python3.9/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /opt/miniconda3/envs/quera_ai/lib/python3.9/site-packages (from openpyxl) (1.1.0)

In [3]:
base_path = "/Users/Mahdi/quera_ai/projects/project1/Project1_data"
r98 = pd.read_excel(base_path + "/R98.xlsx", sheet_name=None, engine = 'openpyxl')

In [4]:
R98 = r98.copy()

In [5]:
file_list = [r98]
file_names = ['R98']

In [6]:
# Develope
def get_columns(columns, prefix):
    file_list = [r98]
    file_names = ['R98']
    for file, file_name in zip(file_list, file_names):
        file[f'{file_name}{prefix}'] = file[f'{file_name}{prefix}'][columns]   
        
file_list = [r98]
file_names = ['R98']
for file, file_name in zip(file_list, file_names):
    file[f'{file_name}P3S01'][(file[f'{file_name}P3S01']['kilogram'].isna()) & (~file[f'{file_name}P3S01']['price'].isna())]['kilogram'] = file[f'{file_name}P3S01']['value'] / file[f'{file_name}P3S01']['price']
    file[f'{file_name}P3S01'][(~file[f'{file_name}P3S01']['kilogram'].isna()) & (file[f'{file_name}P3S01']['price'].isna())]['kilogram'] = file[f'{file_name}P3S01']['value'] / file[f'{file_name}P3S01']['kilogram']
    file[f'{file_name}P3S01'] = file[f'{file_name}P3S01'][~(file[f'{file_name}P3S01']['kilogram'].isna()) | (~file[f'{file_name}P3S01']['price'].isna())]
get_columns(['Address', 'code', 'purchased', 'kilogram', 'value'], 'P3S01')

/var/folders/xn/pc_68lms5455_7h8m5ncshrw0000gp/T/ipykernel_2551/896754946.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  file[f'{file_name}P3S01'][(file[f'{file_name}P3S01']['kilogram'].isna()) & (~file[f'{file_name}P3S01']['price'].isna())]['kilogram'] = file[f'{file_name}P3S01']['value'] / file[f'{file_name}P3S01']['price']

# R98Data

In [8]:
print(r98['R98Data'].columns)
r98['R98Data'] = r98['R98Data'][['Address', 'Fasl', 'weight', 'khanevartype', 'province','town']]

Index(['Address', 'MahMorajeh', 'Fasl', 'weight', 'khanevartype', 'Takmil',
       'TakmilDescA', 'TakmilDescB', 'TakmilDescC', 'Jaygozin',
       'JaygozinDescA', 'JaygozinDescB', 'JaygozinDescC', 'BlkAbdJaygozin',
       'RadifJaygozin', 'province', 'town'],
      dtype='object')

In [9]:
r98['R98Data'].isna().mean()*100

Address         0.0
Fasl            0.0
weight          0.0
khanevartype    0.0
province        0.0
town            0.0
dtype: float64

# r98P4S01

In [12]:
r98['R98P4S01'].isna().mean()*100

Address            0.000000
member             0.000000
employed_w         0.000000
ISCO_w             0.000000
ISIC_w             0.000000
status_w           0.000000
hours_w           12.033272
days_w            12.042514
income_w_m         0.000000
income_w_y         0.000000
wage_w_m           0.055453
wage_w_y           0.027726
perk_w_m           0.073937
perk_w_y           0.027726
netincome_w_m      0.000000
netincome_w_y      0.000000
Fasl               0.000000
year               0.000000
DYCOL00          100.000000
dtype: float64

In [13]:
R98_P4S01_mahdi = r98['R98P4S01'][['Address', 'member', 'employed_w', 'ISCO_w', 'ISIC_w', 'status_w' , 'hours_w', 'days_w','income_w_y', 'wage_w_y', 'perk_w_y', 'netincome_w_y', 'Fasl', 'year']]
R98_P4S01_mahdi.isna().mean()*100

Address           0.000000
member            0.000000
employed_w        0.000000
ISCO_w            0.000000
ISIC_w            0.000000
status_w          0.000000
hours_w          12.033272
days_w           12.042514
income_w_y        0.000000
wage_w_y          0.027726
perk_w_y          0.027726
netincome_w_y     0.000000
Fasl              0.000000
year              0.000000
dtype: float64

In [36]:
R98_P4S01_mahdi.shape

(9512, 14)

In [14]:
print(R98_P4S01_mahdi[R98_P4S01_mahdi['wage_w_y'].isna()].index)
print(R98_P4S01_mahdi[R98_P4S01_mahdi['perk_w_y'].isna()].index)
R98_P4S01_mahdi[(R98_P4S01_mahdi['perk_w_y'].isna()) | (R98_P4S01_mahdi['wage_w_y'].isna())]

Index([9480, 9481, 9482], dtype='int64')
Index([9480, 9481, 9482], dtype='int64')

,Address,member,employed_w,ISCO_w,ISIC_w,status_w,hours_w,days_w,income_w_y,wage_w_y,perk_w_y,netincome_w_y,Fasl,year
9480,21407551823,3,1,7518,10730,3,8.0,6.0,180000000,NaN,NaN,180000000,4,98
9481,21407551820,2,1,9314,41000,3,8.0,6.0,1500000000,NaN,NaN,150000000,4,98
9482,21407551811,1,1,6121,1411,3,8.0,6.0,77000000,NaN,NaN,77000000,4,98

In [15]:
R98_P4S01_mahdi = R98_P4S01_mahdi[~R98_P4S01_mahdi['hours_w'].isna()]
R98_P4S01_mahdi = R98_P4S01_mahdi[~R98_P4S01_mahdi['days_w'].isna()]

In [16]:
X = R98_P4S01_mahdi[(~R98_P4S01_mahdi['perk_w_y'].isna()) & (~R98_P4S01_mahdi['wage_w_y'].isna())].drop(['Address', 'member', 'wage_w_y', 'perk_w_y'], axis = 1)
y1 = R98_P4S01_mahdi[(~R98_P4S01_mahdi['perk_w_y'].isna()) & (~R98_P4S01_mahdi['wage_w_y'].isna())]['wage_w_y']
y2 = R98_P4S01_mahdi[(~R98_P4S01_mahdi['perk_w_y'].isna()) & (~R98_P4S01_mahdi['wage_w_y'].isna())]['perk_w_y']

X_train, X_validation, y1_train, y1_validation = train_test_split(X, y1, test_size=0.25, random_state=42)
X_train, X_validation, y2_train, y2_validation = train_test_split(X, y2, test_size=0.25, random_state=42)

model = RandomForestRegressor(n_estimators=100)
model.fit(X_train, y1_train)
y1_pred_validation = model.predict(X_validation)
mean_squared_error_1 = mean_squared_error(y1_validation, y1_pred_validation)
r2_score_1 = r2_score(y1_validation, y1_pred_validation)
print("--- wage_w_y ---")
print(f"mean_squared_error = {mean_squared_error_1}")
print(f"r2_score = {r2_score_1}")

model = RandomForestRegressor(n_estimators=1000)
model.fit(X_train, y2_train)
y2_pred_validation = model.predict(X_validation)
mean_squared_error_2 = mean_squared_error(y2_validation, y2_pred_validation)
r2_score_2 = r2_score(y2_validation, y2_pred_validation)
print("--- perk_w_y ---")
print("--- RandomForestRegressor ---")
print(f"mean_squared_error = {mean_squared_error_2}")
print(f"r2_score = {r2_score_2}")

model = GradientBoostingRegressor()
model.fit(X_train, y2_train)
y2_pred_validation = model.predict(X_validation)
mean_squared_error_2 = mean_squared_error(y2_validation, y2_pred_validation)
r2_score_2 = r2_score(y2_validation, y2_pred_validation)
print("--- perk_w_y ---")
print("--- GradientBoostingRegressor ---")
print(f"mean_squared_error = {mean_squared_error_2}")
print(f"r2_score = {r2_score_2}")

--- wage_w_y ---
mean_squared_error = 379769333140169.0
r2_score = 0.9670811294473213
--- perk_w_y ---
--- RandomForestRegressor ---
mean_squared_error = 221972926767666.28
r2_score = 0.24980790902138406
--- perk_w_y ---
--- GradientBoostingRegressor ---
mean_squared_error = 186519978910252.4
r2_score = 0.36962667012799

In [17]:
R98_P4S01_mahdi = R98_P4S01_mahdi.loc[(~R98_P4S01_mahdi['perk_w_y'].isna()) | (~R98_P4S01_mahdi['wage_w_y'].isna())]

# r98P4S02

In [19]:
r98['R98P4S02'].isna().mean()*100

Address              0.000000
member               0.000000
employed_s           0.000000
ISCO_s               0.000000
ISIC_s               0.000000
status_s             0.000000
agriculture          0.000000
hours_s              1.764419
days_s               1.764419
cost_employment      9.791478
cost_raw             2.120092
cost_machinery       8.745380
cost_others          5.111932
cost_tax            12.490411
sale                 1.610991
income_s_y           0.000000
Fasl                 0.000000
year                 0.000000
DYCOL00            100.000000
dtype: float64

In [20]:
r98['R98P4S02'].columns

Index(['Address', 'member', 'employed_s', 'ISCO_s', 'ISIC_s', 'status_s',
       'agriculture', 'hours_s', 'days_s', 'cost_employment', 'cost_raw',
       'cost_machinery', 'cost_others', 'cost_tax', 'sale', 'income_s_y',
       'Fasl', 'year', 'DYCOL00'],
      dtype='object')

In [21]:
r98_P4S02_mahdi = r98['R98P4S02'][['Address', 'member', 'employed_s', 'ISCO_s', 'ISIC_s', 'status_s', 'agriculture', 'sale', 'income_s_y', 'Fasl', 'year']]
r98_P4S02_mahdi = r98_P4S02_mahdi[(~r98_P4S02_mahdi['employed_s'].isna()) & (~r98_P4S02_mahdi['ISCO_s'].isna()) & (~r98_P4S02_mahdi['ISIC_s'].isna()) & (~r98_P4S02_mahdi['status_s'].isna()) & (~r98_P4S02_mahdi['agriculture'].isna())]

In [22]:
r98_P4S02_mahdi.isna().mean()*100

Address        0.000000
member         0.000000
employed_s     0.000000
ISCO_s         0.000000
ISIC_s         0.000000
status_s       0.000000
agriculture    0.000000
sale           1.610991
income_s_y     0.000000
Fasl           0.000000
year           0.000000
dtype: float64

In [23]:
print(len(r98_P4S02_mahdi[r98_P4S02_mahdi['sale'].isna()]))
print(len(r98_P4S02_mahdi[r98_P4S02_mahdi['sale'] == 0]))
print(len(r98_P4S02_mahdi[r98_P4S02_mahdi['income_s_y'].isna()]))
print(len(r98_P4S02_mahdi[r98_P4S02_mahdi['income_s_y'] == 0]))

231
2850
0
2905

In [24]:
r98_P4S02_mahdi[(r98_P4S02_mahdi['sale'] == 0) | (r98_P4S02_mahdi['sale'].isna())]['employed_s'].value_counts()

employed_s
1    3054
2      27
Name: count, dtype: int64

In [25]:
r98_P4S02_mahdi[(r98_P4S02_mahdi['income_s_y'] == 0) | (r98_P4S02_mahdi['income_s_y'].isna())]['employed_s'].value_counts()

employed_s
1    2880
2      25
Name: count, dtype: int64

In [26]:
r98_P4S02_mahdi.loc[((r98_P4S02_mahdi['income_s_y'] == 0) | (r98_P4S02_mahdi['income_s_y'].isna())) & (r98_P4S02_mahdi['employed_s'] == 2), 'income_s_y'] = 0
r98_P4S02_mahdi.loc[((r98_P4S02_mahdi['sale'] == 0) | (r98_P4S02_mahdi['sale'].isna())) & (r98_P4S02_mahdi['employed_s'] == 2), 'sale'] = 0

In [27]:
X = r98_P4S02_mahdi[~r98_P4S02_mahdi['sale'].isna()].drop(['Address', 'member', 'sale'], axis = 1)
y1 = r98_P4S02_mahdi[~r98_P4S02_mahdi['sale'].isna()]['sale']
X_train, X_validation, y_train, y_validation = train_test_split(X, y1, test_size=0.25, random_state=42)

model = RandomForestRegressor(n_estimators=100)
model.fit(X_train, y_train)
y_pred_validation = model.predict(X_validation)
r2 = r2_score(y_validation, y_pred_validation)
print(f"r2_score = {r2}")

model = GradientBoostingRegressor()
model.fit(X_train, y_train)
y_pred_validation = model.predict(X_validation)
r2 = r2_score(y_validation, y_pred_validation)
print(f"r2_score = {r2}")

model = SVC(kernel='rbf')
model.fit(X_train, y_train)
y_pred_validation = model.predict(X_validation)
r2 = r2_score(y_validation, y_pred_validation)
print(f"r2_score = {r2}")

model = model = MLPRegressor(hidden_layer_sizes=(50, 50), max_iter=1000)
model.fit(X_train, y_train)
y_pred_validation = model.predict(X_validation)
r2 = r2_score(y_validation, y_pred_validation)
print(f"r2_score = {r2}")

r2_score = 0.1735509068844422
r2_score = 0.18744660081225117
r2_score = 0.12801848671121663
r2_score = 0.29450501809872387

In [28]:
r98_P4S02_mahdi = r98_P4S02_mahdi[~r98_P4S02_mahdi['sale'].isna()]

# R98P4S03

In [29]:
r98['R98P4S03'].isna().mean()*100

Address              0.000000
member               0.000000
income_pension      67.105752
income_rent         70.834440
income_interest     29.771073
income_aid          44.999203
income_resale       74.116960
income_transfer     56.222446
Fasl                 0.000000
year                 0.000000
DYCOL00            100.000000
dtype: float64

In [30]:
r98_P4S03_mahdi = r98['R98P4S03'].drop(['DYCOL00'], axis = 1)

# r98_P4S04

In [32]:
r98['R98P4S04'].isna().mean()*100

Address             0.0
member              0.0
subsidy_number      0.0
subsidy_month       0.0
subsidy             0.0
Fasl                0.0
year                0.0
DYCOL00           100.0
dtype: float64

In [33]:
r98_P4S04_mahdi = r98['R98P4S04'].drop(['DYCOL00'], axis = 1)

# Mahdi's Files

In [34]:
R98_P4S01_mahdi
r98_P4S02_mahdi
r98_P4S03_mahdi
r98_P4S04_mahdi

,Address,member,subsidy_number,subsidy_month,subsidy,Fasl,year
0,20011395420,1,3,12,16380000,1,98
1,20001385412,1,4,12,21840000,1,98
2,20001385423,1,2,12,10920000,1,98
3,20001385420,1,1,12,5460000,1,98
4,20011395407,1,4,12,21840000,1,98
...,...,...,...,...,...,...,...
19605,23001700611,1,2,12,10920000,4,98
19606,23001700611,3,2,12,10920000,4,98
19607,23001701017,1,3,12,16380000,4,98
19608,23001701020,1,3,12,16380000,4,98
19609,23002703423,1,1,12,5460000,4,98

# R98_P4S01

In [35]:
R98_P4S01_mahdi.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9512 entries, 0 to 10819
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Address        9512 non-null   int64
 1   member         9512 non-null   int64
 2   employed_w     9512 non-null   int64
 3   ISCO_w         9512 non-null   int64
 4   ISIC_w         9512 non-null   int64
 5   status_w       9512 non-null   int64
 6   hours_w        9512 non-null   float64
 7   days_w         9512 non-null   float64
 8   income_w_y     9512 non-null   int64
 9   wage_w_y       9512 non-null   float64
 10  perk_w_y       9512 non-null   float64
 11  netincome_w_y  9512 non-null   int64
 12  Fasl           9512 non-null   int64
 13  year           9512 non-null   int64
dtypes: float64(4), int64(10)
memory usage: 1.1 MB

In [37]:
print(R98_P4S01_mahdi.shape)
test_duplicate = R98_P4S01_mahdi.drop_duplicates()
print(test_duplicate.shape)

(9512, 14)
(9512, 14)

In [38]:
R98_P4S01_mahdi_employed_no_income = R98_P4S01_mahdi[(R98_P4S01_mahdi['employed_w'] == 1) & (R98_P4S01_mahdi['netincome_w_y'] == 0)]
R98_P4S01_mahdi_unemployed_with_income = R98_P4S01_mahdi[(R98_P4S01_mahdi['employed_w'] == 2) & (R98_P4S01_mahdi['netincome_w_y'] != 0)]

print(len(R98_P4S01_mahdi))
print(len(R98_P4S01_mahdi_employed_no_income))
print(len(R98_P4S01_mahdi_unemployed_with_income))

9512
29
176

In [39]:
R98_P4S01_mahdi_employed_no_income_condition = (R98_P4S01_mahdi['employed_w'] == 1) & (R98_P4S01_mahdi['netincome_w_y'] == 0)
R98_P4S01_mahdi_unemployed_with_income_condition = (R98_P4S01_mahdi['employed_w'] == 2) & (R98_P4S01_mahdi['netincome_w_y'] != 0)

R98_P4S01_mahdi_clean = R98_P4S01_mahdi[~(R98_P4S01_mahdi_employed_no_income_condition | R98_P4S01_mahdi_unemployed_with_income_condition)]
R98_P4S01_mahdi_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9307 entries, 0 to 10819
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Address        9307 non-null   int64
 1   member         9307 non-null   int64
 2   employed_w     9307 non-null   int64
 3   ISCO_w         9307 non-null   int64
 4   ISIC_w         9307 non-null   int64
 5   status_w       9307 non-null   int64
 6   hours_w        9307 non-null   float64
 7   days_w         9307 non-null   float64
 8   income_w_y     9307 non-null   int64
 9   wage_w_y       9307 non-null   float64
 10  perk_w_y       9307 non-null   float64
 11  netincome_w_y  9307 non-null   int64
 12  Fasl           9307 non-null   int64
 13  year           9307 non-null   int64
dtypes: float64(4), int64(10)
memory usage: 1.1 MB

In [40]:
r98_P4S01_family_netincome = R98_P4S01_mahdi_clean[['Address', 'netincome_w_y']]
r98_P4S01_family_netincome = r98_P4S01_family_netincome.groupby('Address')['netincome_w_y'].sum().reset_index()
r98_P4S01_family_netincome['Address'].is_unique
len(r98_P4S01_family_netincome)

7807

# r98_P4S02

In [41]:
r98_P4S02_mahdi

,Address,member,employed_s,ISCO_s,ISIC_s,status_s,agriculture,sale,income_s_y,Fasl,year
0,20011395420,1,1,6121,1440,5,1,142500000.0,72500000,1,98
1,20001385423,1,1,6111,1110,5,1,113000000.0,70000000,1,98
2,20011395407,1,1,6111,1110,5,1,185000000.0,108500000,1,98
3,20011395407,1,1,6121,1440,5,1,205000000.0,100000000,1,98
4,20004387823,1,1,8322,49230,5,2,190000000.0,120000000,1,98
...,...,...,...,...,...,...,...,...,...,...,...
14334,23002703011,1,1,8322,49220,5,2,240000000.0,140000000,4,98
14335,23002703011,2,1,5120,47212,5,2,470000000.0,130000000,4,98
14336,23002703814,1,1,8322,49220,5,2,420000000.0,340000000,4,98
14337,23006708208,1,1,5120,47510,5,2,184000000.0,184000000,4,98
14338,23001701414,1,1,5224,47212,5,2,456000000.0,300000000,4,98

In [42]:
print(r98_P4S02_mahdi.shape)
test_duplicate = r98_P4S02_mahdi.drop_duplicates()
print(test_duplicate.shape)

(14108, 11)
(14107, 11)

In [43]:
r98_P4S02_mahdi_employed_no_income = r98_P4S02_mahdi[(r98_P4S02_mahdi['employed_s'] == 1) & (r98_P4S02_mahdi['income_s_y'] == 0)]
r98_P4S02_mahdi_unemployed_with_income = r98_P4S02_mahdi[(r98_P4S02_mahdi['employed_s'] == 2) & (r98_P4S02_mahdi['income_s_y'] != 0)]

print(len(r98_P4S02_mahdi))
print(len(r98_P4S02_mahdi_employed_no_income))
print(len(r98_P4S02_mahdi_unemployed_with_income))

14108
2650
288

In [44]:
r98_P4S02_mahdi_employed_no_income[r98_P4S02_mahdi_employed_no_income['agriculture']!=2]

,Address,member,employed_s,ISCO_s,ISIC_s,status_s,agriculture,sale,income_s_y,Fasl,year
244,20207409917,3,1,9214,1230,6,1,0.0,0,1,98
250,20214411123,2,1,6121,1411,6,1,0.0,0,1,98
271,20225415911,3,1,9211,1610,6,1,0.0,0,1,98
295,20204407914,2,1,6111,1120,6,1,0.0,0,1,98
298,20204407917,2,1,6111,1130,6,1,0.0,0,1,98
...,...,...,...,...,...,...,...,...,...,...,...
14276,22905694408,2,1,6121,1440,6,1,0.0,0,4,98
14277,22905694408,3,1,6121,1440,6,1,0.0,0,4,98
14278,22905694408,4,1,6121,1440,6,1,0.0,0,4,98
14289,22904692808,3,1,6121,1440,6,1,0.0,0,4,98
14292,22905694020,2,1,6121,1440,6,1,0.0,0,4,98

In [46]:
test_employment_income = r98['R98P4S02']

In [47]:
r98_P4S02_mahdi_employed_no_income_test = test_employment_income[(test_employment_income['employed_s'] == 1) & (test_employment_income['income_s_y'] == 0)]
r98_P4S02_selected_columns = r98_P4S02_mahdi_employed_no_income_test[['cost_employment', 'cost_raw', 'cost_machinery', 'cost_others', 'sale','income_s_y']]
# r98_P4S02_mahdi_employed_no_income_test.info()
num_zero_or_nan_cost_raw = ((r98_P4S02_selected_columns['cost_others'] == 0) | r98_P4S02_selected_columns['cost_others'].isna()).sum()
print(len(r98_P4S02_mahdi_employed_no_income_test))
print(num_zero_or_nan_cost_raw)

2880
2876

In [48]:
not_zero_not_nan_cost_raw = r98_P4S02_selected_columns[(r98_P4S02_selected_columns['cost_others'] != 0) & r98_P4S02_selected_columns['cost_others'].notna()]
print(not_zero_not_nan_cost_raw)
print(len(not_zero_not_nan_cost_raw))

       cost_employment    cost_raw  cost_machinery  cost_others        sale  \
1399        18000000.0  34000000.0      13000000.0    5000000.0  70000000.0
1993               0.0   9000000.0             0.0     500000.0   9500000.0
8849               0.0         0.0             0.0   30000000.0  30000000.0
13540              0.0  55000000.0             0.0   15000000.0  70000000.0

       income_s_y
1399            0
1993            0
8849            0
13540           0
4

In [49]:
r98_P4S02_mahdi_employed_no_income_condition = (r98_P4S02_mahdi['employed_s'] == 1) & (r98_P4S02_mahdi['income_s_y'] == 0)
r98_P4S02_mahdi_unemployed_with_income_condition = (r98_P4S02_mahdi['employed_s'] == 2) & (r98_P4S02_mahdi['income_s_y'] != 0)

r98_P4S02_mahdi_clean = r98_P4S02_mahdi[~(r98_P4S02_mahdi_employed_no_income_condition | r98_P4S02_mahdi_unemployed_with_income_condition)]
r98_P4S02_mahdi_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11170 entries, 0 to 14338
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Address      11170 non-null  int64
 1   member       11170 non-null  int64
 2   employed_s   11170 non-null  int64
 3   ISCO_s       11170 non-null  int64
 4   ISIC_s       11170 non-null  int64
 5   status_s     11170 non-null  int64
 6   agriculture  11170 non-null  int64
 7   sale         11170 non-null  float64
 8   income_s_y   11170 non-null  int64
 9   Fasl         11170 non-null  int64
 10  year         11170 non-null  int64
dtypes: float64(1), int64(10)
memory usage: 1.0 MB

In [50]:
r98_P4S02_family_netincome = r98_P4S02_mahdi_clean[['Address', 'income_s_y']]
r98_P4S02_family_netincome = r98_P4S02_family_netincome.groupby('Address')['income_s_y'].sum().reset_index()
r98_P4S02_family_netincome['Address'].is_unique
len(r98_P4S02_family_netincome)

8166

# R98_P4S03

In [51]:
r98_P4S03_mahdi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18827 entries, 0 to 18826
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Address          18827 non-null  int64
 1   member           18827 non-null  int64
 2   income_pension   6193 non-null   object
 3   income_rent      5491 non-null   object
 4   income_interest  13222 non-null  float64
 5   income_aid       10355 non-null  float64
 6   income_resale    4873 non-null   float64
 7   income_transfer  8242 non-null   float64
 8   Fasl             18827 non-null  int64
 9   year             18827 non-null  int64
dtypes: float64(4), int64(4), object(2)
memory usage: 1.4+ MB

In [52]:
print(r98_P4S03_mahdi.shape)
test_duplicate = r98_P4S03_mahdi.drop_duplicates()
print(test_duplicate.shape)

(18827, 10)
(18827, 10)

In [53]:
r98_P4S03_mahdi.head()

,Address,member,income_pension,income_rent,income_interest,income_aid,income_resale,income_transfer,Fasl,year
0,20001385412,1,NaN,0024600000,NaN,NaN,NaN,NaN,1,98
1,20001385423,1,0154000000,NaN,NaN,NaN,NaN,NaN,1,98
2,20001385420,1,0130000000,NaN,NaN,NaN,NaN,NaN,1,98
3,20011395423,1,NaN,NaN,NaN,NaN,5000000.0,5000000.0,1,98
4,20011395416,1,NaN,0080000000,NaN,12000000.0,NaN,NaN,1,98

In [54]:
r98_P4S03_family_netincome = r98_P4S03_mahdi.copy()
r98_P4S03_family_netincome['income_pension'] = pd.to_numeric(r98_P4S03_family_netincome['income_pension'], errors='coerce')
r98_P4S03_family_netincome['income_rent'] = pd.to_numeric(r98_P4S03_family_netincome['income_rent'], errors='coerce')

In [55]:
r98_P4S03_family_netincome.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18827 entries, 0 to 18826
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Address          18827 non-null  int64
 1   member           18827 non-null  int64
 2   income_pension   6191 non-null   float64
 3   income_rent      5488 non-null   float64
 4   income_interest  13222 non-null  float64
 5   income_aid       10355 non-null  float64
 6   income_resale    4873 non-null   float64
 7   income_transfer  8242 non-null   float64
 8   Fasl             18827 non-null  int64
 9   year             18827 non-null  int64
dtypes: float64(6), int64(4)
memory usage: 1.4 MB

In [56]:
r98_P4S03_family_netincome.head()

,Address,member,income_pension,income_rent,income_interest,income_aid,income_resale,income_transfer,Fasl,year
0,20001385412,1,NaN,24600000.0,NaN,NaN,NaN,NaN,1,98
1,20001385423,1,154000000.0,NaN,NaN,NaN,NaN,NaN,1,98
2,20001385420,1,130000000.0,NaN,NaN,NaN,NaN,NaN,1,98
3,20011395423,1,NaN,NaN,NaN,NaN,5000000.0,5000000.0,1,98
4,20011395416,1,NaN,80000000.0,NaN,12000000.0,NaN,NaN,1,98

In [57]:
r98_P4S03_family_netincome['total_income'] = (
    r98_P4S03_family_netincome['income_pension'].fillna(0) +
    r98_P4S03_family_netincome['income_rent'].fillna(0) +
    r98_P4S03_family_netincome['income_interest'].fillna(0) +
    r98_P4S03_family_netincome['income_aid'].fillna(0) +
    r98_P4S03_family_netincome['income_resale'].fillna(0) +
    r98_P4S03_family_netincome['income_transfer'].fillna(0)
)
r98_P4S03_family_netincome.head()

,Address,member,income_pension,income_rent,income_interest,income_aid,income_resale,income_transfer,Fasl,year,total_income
0,20001385412,1,NaN,24600000.0,NaN,NaN,NaN,NaN,1,98,24600000.0
1,20001385423,1,154000000.0,NaN,NaN,NaN,NaN,NaN,1,98,154000000.0
2,20001385420,1,130000000.0,NaN,NaN,NaN,NaN,NaN,1,98,130000000.0
3,20011395423,1,NaN,NaN,NaN,NaN,5000000.0,5000000.0,1,98,10000000.0
4,20011395416,1,NaN,80000000.0,NaN,12000000.0,NaN,NaN,1,98,92000000.0

In [66]:
r98_P4S03_family_netincome.shape

(18827, 11)

In [67]:
r98_P4S03_family_netincome = r98_P4S03_family_netincome[['Address', 'total_income']]
r98_P4S03_family_netincome = r98_P4S03_family_netincome.groupby('Address')['total_income'].sum().reset_index()
r98_P4S03_family_netincome.shape

(13563, 2)

In [69]:
r98_P4S03_family_netincome.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13563 entries, 0 to 13562
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Address       13563 non-null  int64
 1   total_income  13563 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 212.0 KB

# R98_P4S04

In [70]:
r98_P4S04_family_netincome = r98_P4S04_mahdi.copy()
r98_P4S04_family_netincome.info()
print(r98_P4S04_family_netincome.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19610 entries, 0 to 19609
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Address         19610 non-null  int64
 1   member          19610 non-null  int64
 2   subsidy_number  19610 non-null  int64
 3   subsidy_month   19610 non-null  int64
 4   subsidy         19610 non-null  int64
 5   Fasl            19610 non-null  int64
 6   year            19610 non-null  int64
dtypes: int64(7)
memory usage: 1.0 MB
(19610, 7)

In [71]:
r98_P4S04_family_netincome = r98_P4S04_family_netincome[['Address', 'subsidy']]
r98_P4S04_family_netincome = r98_P4S04_family_netincome.groupby('Address')['subsidy'].sum().reset_index()
r98_P4S04_family_netincome.shape

(17949, 2)

# net income sources

In [72]:
r98_P4S01_family_netincome_column = r98_P4S01_family_netincome.rename(columns={'netincome_w_y': 'netincome'})
r98_P4S02_family_netincome_column = r98_P4S02_family_netincome.rename(columns={'income_s_y': 'netincome'})
r98_P4S03_family_netincome_column = r98_P4S03_family_netincome.rename(columns={'total_income': 'netincome'})
r98_P4S04_family_netincome_column = r98_P4S04_family_netincome.rename(columns={'subsidy': 'netincome'})
print(r98_P4S03_family_netincome_column.columns)
# isna??

Index(['Address', 'netincome'], dtype='object')

In [73]:
merged_df_netincome = r98_P4S01_family_netincome_column.merge(r98_P4S02_family_netincome_column, on='Address', how='outer', suffixes=('_P4S01', '_P4S02'))

r98_P4S03_family_netincome_column = r98_P4S03_family_netincome_column.rename(columns={'netincome': 'netincome_P4S03'})
merged_df_netincome = merged_df_netincome.merge(r98_P4S03_family_netincome_column, on='Address', how='outer')

r98_P4S04_family_netincome_column = r98_P4S04_family_netincome_column.rename(columns={'netincome': 'netincome_P4S04'})
merged_df_netincome = merged_df_netincome.merge(r98_P4S04_family_netincome_column, on='Address', how='outer')


merged_df_netincome = merged_df_netincome.fillna(0)
merged_df_netincome.head()

merged_df_netincome['total_netincome'] = (
    merged_df_netincome['netincome_P4S01'] +
    merged_df_netincome['netincome_P4S02'] +
    merged_df_netincome['netincome_P4S03'] +
    merged_df_netincome['netincome_P4S04']
)

In [74]:
total_net_income = merged_df_netincome
total_net_income.shape

(18429, 6)

In [75]:
total_net_income.describe()

,Address,netincome_P4S01,netincome_P4S02,netincome_P4S03,netincome_P4S04,total_netincome
count,1.842900e+04,1.842900e+04,1.842900e+04,1.842900e+04,1.842900e+04,1.842900e+04
mean,2.146045e+10,7.998095e+07,9.078631e+07,4.796588e+07,1.860049e+07,2.373336e+08
std,9.080447e+08,1.286890e+08,1.884150e+08,1.033560e+08,8.873931e+06,2.179380e+08
min,2.000138e+10,0.000000e+00,-5.928000e+08,0.000000e+00,0.000000e+00,-5.640000e+08
25%,2.070447e+10,0.000000e+00,0.000000e+00,0.000000e+00,1.092000e+07,1.093000e+08
50%,2.140455e+10,0.000000e+00,0.000000e+00,6.150000e+06,1.638000e+07,1.954600e+08
75%,2.221063e+10,1.350000e+08,1.300000e+08,4.563000e+07,2.184000e+07,3.053800e+08
max,2.300671e+10,2.554000e+09,4.680000e+09,5.000000e+09,1.092000e+08,5.010920e+09

In [76]:
total_net_income.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18429 entries, 0 to 18428
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Address          18429 non-null  int64
 1   netincome_P4S01  18429 non-null  float64
 2   netincome_P4S02  18429 non-null  float64
 3   netincome_P4S03  18429 non-null  float64
 4   netincome_P4S04  18429 non-null  float64
 5   total_netincome  18429 non-null  float64
dtypes: float64(5), int64(1)
memory usage: 864.0 KB

In [77]:
total_net_income.head()

,Address,netincome_P4S01,netincome_P4S02,netincome_P4S03,netincome_P4S04,total_netincome
0,20001383916,236360008.0,0.0,0.0,21840000.0,258200008.0
1,20001383920,216000000.0,0.0,0.0,27300000.0,243300000.0
2,20001383923,372000000.0,0.0,0.0,21840000.0,393840000.0
3,20001384011,120000000.0,0.0,0.0,16380000.0,136380000.0
4,20001384015,55000000.0,0.0,5000000.0,21840000.0,81840000.0

In [ ]:
# agriculture in urban?

In [79]:
r98_data = r98['R98Data']

In [80]:
r98_data.describe()

            Address          Fasl        weight  khanevartype          town
count  1.843000e+04  18430.000000  18430.000000  18430.000000  18430.000000
mean   2.146043e+10      2.477428    331.818882      1.000488      7.689202
std    9.080236e+08      1.110434    263.327494      0.022093      6.419986
min    2.000138e+10      1.000000     41.022802      1.000000      1.000000
25%    2.070447e+10      1.000000    142.816582      1.000000      3.000000
50%    2.140455e+10      2.000000    275.868953      1.000000      6.000000
75%    2.221063e+10      3.000000    446.379846      1.000000     10.000000
max    2.300671e+10      4.000000   5254.802639      2.000000     39.000000

In [81]:
r98_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18430 entries, 0 to 18429
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Address       18430 non-null  int64
 1   Fasl          18430 non-null  int64
 2   weight        18430 non-null  float64
 3   khanevartype  18430 non-null  int64
 4   province      18430 non-null  object
 5   town          18430 non-null  int64
dtypes: float64(1), int64(4), object(1)
memory usage: 864.0+ KB

In [82]:
r98_data.head()

       Address  Fasl      weight  khanevartype province  town
0  20001383908     2  171.199524             1  Markazi     1
1  20001383911     2  171.199524             1  Markazi     1
2  20001383915     2  171.199524             1  Markazi     1
3  20001383916     2  171.199524             1  Markazi     1
4  20001383920     2  171.199524             1  Markazi     1

In [83]:
total_income_province = r98_data.merge(total_net_income, on='Address', how='left')

In [84]:
total_income_province.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18430 entries, 0 to 18429
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Address          18430 non-null  int64
 1   Fasl             18430 non-null  int64
 2   weight           18430 non-null  float64
 3   khanevartype     18430 non-null  int64
 4   province         18430 non-null  object
 5   town             18430 non-null  int64
 6   netincome_P4S01  18429 non-null  float64
 7   netincome_P4S02  18429 non-null  float64
 8   netincome_P4S03  18429 non-null  float64
 9   netincome_P4S04  18429 non-null  float64
 10  total_netincome  18429 non-null  float64
dtypes: float64(6), int64(4), object(1)
memory usage: 1.5+ MB

In [85]:
total_income_province.head()
unique_provinces = total_income_province['province'].unique()
print(unique_provinces)

['Markazi' 'Gilan' 'Mazandaran' 'AzarbaijanSharghi' 'AzarbaijanGharbi'
 'Kermanshah' 'Kouzestan' 'Fars' 'Kerman' 'KhorasanRazavi' 'Esfahan'
 'SistanBalouchestan' 'Kordestan' 'Hamedan' 'CharmahalBakhtiari'
 'Lorestan' 'Ilam' 'KohkilouyeBoyerahamad' 'Boushehr' 'Zanjan' 'Semnan'
 'Yazd' 'Hormozgan' 'Tehran' 'Ardebil' 'Qom' 'Qazvin' 'Golestan'
 'KhorasanShomali' 'KhorasanJonoubi' 'Alborz']

In [87]:
rural_chaharmahal_data = total_income_province[total_income_province['province']=='CharmahalBakhtiari']
rural_chaharmahal_data.head()
print(len(rural_chaharmahal_data))
nan_netincome_rows = rural_chaharmahal_data[rural_chaharmahal_data['total_netincome'].isna()]
print(nan_netincome_rows)

474
Empty DataFrame
Columns: [Address, Fasl, weight, khanevartype, province, town, netincome_P4S01, netincome_P4S02, netincome_P4S03, netincome_P4S04, total_netincome]
Index: []

# R98-CharmahalBakhtiari

In [88]:
rural_chaharmahal_data.head()

,Address,Fasl,weight,khanevartype,province,town,netincome_P4S01,netincome_P4S02,netincome_P4S03,netincome_P4S04,total_netincome
8972,21401545208,2,132.659492,1,CharmahalBakhtiari,1,144000000.0,0.0,2040000.0,16380000.0,162420000.0
8973,21401545211,2,132.659492,1,CharmahalBakhtiari,1,0.0,288250000.0,1560000.0,16380000.0,306190000.0
8974,21401545214,2,132.659492,1,CharmahalBakhtiari,1,0.0,0.0,50000000.0,10920000.0,60920000.0
8975,21401545217,2,132.659492,1,CharmahalBakhtiari,1,0.0,0.0,22660000.0,5460000.0,28120000.0
8976,21401545220,2,132.659492,1,CharmahalBakhtiari,1,0.0,0.0,33540000.0,5460000.0,39000000.0